<?php
/*
| ------------------------------------------------------------------------------
| Date format - Required extension: php-intl
| ------------------------------------------------------------------------------
| {{ '2022-11-02' | datef }}
|
| Output [en]:
| November 2, 2022
|
| Output [pt-BR]:
| 2 de novembro de 2022
| ------------------------------------------------------------------------------
*/
Sciola\Template::twigFilter('datef', function ($date) {
        $formatter = new IntlDateFormatter(Sciola\Settings::language(),
                                           IntlDateFormatter::LONG,
                                           IntlDateFormatter::NONE);
        return $formatter->format(new DateTime($date));
});
/*
| ------------------------------------------------------------------------------
| Remove accent
| ------------------------------------------------------------------------------
| {{ 'ÁÉÍóú são àçô' | remove_accent }} // AEIou sao aco
| ------------------------------------------------------------------------------
*/
Sciola\Template::twigFilter('remove_accent', function ($str) {
    return preg_replace(array("/(á|à|ã|â|ä)/",
                              "/(Á|À|Ã|Â|Ä)/",
                              "/(é|è|ê|ë)/",
                              "/(É|È|Ê|Ë)/",
                              "/(í|ì|î|ï)/",
                              "/(Í|Ì|Î|Ï)/",
                              "/(ó|ò|õ|ô|ö)/",
                              "/(Ó|Ò|Õ|Ô|Ö)/",
                              "/(ú|ù|û|ü)/",
                              "/(Ú|Ù|Û|Ü)/",
                              "/(ñ)/",
                              "/(Ñ)/",
                              "/(ç)/",
                              "/(Ç)/"),
                        explode(" ","a A e E i I o O u U n N c C"), $str);
});
/*
| ------------------------------------------------------------------------------
| Format route
| ------------------------------------------------------------------------------
| {{ 'ÁÉÍóú são àçô' | route }} // aeiou-sao-aco
| ------------------------------------------------------------------------------
*/
Sciola\Template::twigFilter('route', function ($str) {
    $str = trim($str);
    $str = preg_replace(array("/(á|à|ã|â|ä)/",
                              "/(Á|À|Ã|Â|Ä)/",
                              "/(é|è|ê|ë)/",
                              "/(É|È|Ê|Ë)/",
                              "/(í|ì|î|ï)/",
                              "/(Í|Ì|Î|Ï)/",
                              "/(ó|ò|õ|ô|ö)/",
                              "/(Ó|Ò|Õ|Ô|Ö)/",
                              "/(ú|ù|û|ü)/",
                              "/(Ú|Ù|Û|Ü)/",
                              "/(ñ)/",
                              "/(Ñ)/",
                              "/(ç)/",
                              "/(Ç)/"),
                        explode(" ","a A e E i I o O u U n N c C"), $str);
    $str = strtolower($str);
    $str = str_replace(' ', '-', $str);
    $str = preg_replace('/[^a-zA-Z0-9-]/', '', $str);
    return $str;
});
